the-spirituality-of-risk-taking.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://rillonline.github.io/rss.xml"
      title="RSS feed for https://rillonline.github.io/">
<title>The Spirituality of Risk Taking</title>
</head>
<body>
<div id="preamble" class="status"><div class="sitelinks">
<a href="https://rillonline.github.io/">Home</a> | <a href="https://rillonline.github.io/list-of-tags.html">List of Tags</a> |
<a href="https://rillonline.github.io/about.html">About</a>
 </div><div><h1>Hey there 👋 You are reading Rill Online.</h1></div></div>
<div id="content">
<div class="post-date">01 Jan 2004</div><h1 class="post-title"><a href="https://rillonline.github.io/the-spirituality-of-risk-taking.html">The Spirituality of Risk Taking</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf4fba14">1. The Spirituality of Risk Taking</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgf4fba14" class="outline-2">
<h2 id="orgf4fba14"><span class="section-number-2">1.</span> The Spirituality of Risk Taking</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm a science fiction fan. I like a good space opera with spaceships,
aliens and lots of action. I also like science fiction that explores
what if's. Unlike alternate histories, I don't have to know the real
history before I can enjoy the scenario being laid out before me.
</p>

<p>
More specifically, I'm a Trekkie. (Yeah, yeah, I know, we're called
trekkers, but, we were called Trekkies first.
</p>

<p>
The Next Generation episode of Star Trek that changed my life (really,
it did!) is <a href="https://en.wikipedia.org/wiki/Tapestry_(Star_Trek:_The_Next_Generation)"> Tapestry</a>.
</p>

<p>
After having his artificial heart short-circuited, Captain Picard has an
opportunity to change the trajectory of his life. As a young officer,
Jean-Luc made a choice that now has fatal consequences for him. When
he's given a chance to undo his behavior, his future life changes, too.
Unfortunately, although he's alive, he's miserable. He has, in this new
life, always played it safe. Picard learns that one of the qualities
that makes his life satisfying to him and, coincidentally, makes him a
good starship captain is taking risks.
</p>

<p>
I hadn't seen the series when it aired. I watched it as late night
reruns. As I laid in bed thinking about this particular episode, I
reflected on my own life. It's a scary thing to see an Enterprise
captain
</p>

<p>
reduced to a mature lieutenant junior grade
</p>

<p>
running errands for his superior officers
</p>

<p>
humiliated by the ship's senior staff who once looked up to him
</p>

<p>
I thought about my own life. I realized I benefited more from the
chances I had taken than the times I had played it safe. For example, I
had left a good paying job at IBM when I was offered a buy-out package.
At the time, people close to me thought my action was foolhardy. Later,
when
</p>

<p>
the site was closed
</p>

<p>
the company's stock dropped dramatically in price
</p>

<p>
those still employed by the company had to interview for jobs as if they
were candidates off the street,
</p>

<p>
My decision looked like a wise one.
</p>

<p>
I learned to take risks with my life and work.
</p>

<p>
Sure. There are things that really scare me, risks I won't take:
</p>

<p>
skydiving
</p>

<p>
Ferris wheels now that I'm too big to have my dad riding between my
sister and me
</p>

<p>
Roller coasters I did go with my daughter on  <a href="https://en.wikipedia.org/wiki/Big_Thunder_Mountain_Railroad">Big Thunder Mountain Railroad</a>  in the
Magic Kingdom. She laughed at my fear. What made the ride almost
bearable was sitting in front of some park employees. One was describing
to the other where you could take people off the ride if you had to.)
</p>

<p>
In Babylon Five when Captain Sheridan is dying on zhadum, <a href="https://en.wikipedia.org/wiki/List_of_Babylon_5_characters">Lorien</a> asks
him: <a href="https://www.chronology.org/noframes/b-five/monologues.html">Who are you? Why are you here?</a> Sheridan must answer these basic questions about his existence to
Lorine's satisfaction in order to survive.
</p>

<p>
Socrates is purported to have said, <a href="https://thedailyidea.org/socrates-examined-life/">"The unexamined life is not worth living."</a>  Haraman quoted this to me a
long time ago. Because Haraman told me and because I have had many years
to test this saying, I have come to believe it is true.
</p>

<p>
I learned to reflect on my own life
</p>

<p>
I have many favorite biblical passages. Those of us who find solace and
encouragement and challenge in the Bible do. One of them goes like this:
</p>



<p>
For copyright reasons, I'll read this quotation from The Holy Bible,
American Standard Version.
</p>

<p>
He hath showed thee, O man, what is good; and what doth Jehovah require
of thee, but to do justly, and to love kindness, and to walk humbly with
thy God?
</p>

<p>
(From Micah 6:8)
</p>

<p>
Humble-walking may suggest to you modesty or submissiveness. In
Charlotte's Web ``humble'' was the last adjective Charlotte the spider
used to describe Wilbur the pig. In this context, it meant low to the
ground.
</p>

<p>
In my experience, to walk humbly with my God means
</p>

<p>
An Openness to another point of view
</p>

<p>
a willingness to change my mind
</p>

<p>
a deep desire to align my desires with God's desires
</p>

<p>
Sometimes Christians call this doing God's will.
</p>

<p>
I learned to desire what God desires.
</p>

<p>
So here's the part where I bring my learnings (my spellchecker won't
like this word) together into a spirituality of risk taking. The parts
are:
</p>

<p>
risk taking
</p>

<p>
questions about the nature of my existence
</p>

<p>
a need to examine these questions to draw some conclusions about the
meaning of my life
</p>

<p>
A Scriptural observation about how life is to be lived.
</p>

<p>
a spiritual response to these observations
</p>

<p>
It really boils down to Lorine's questions only Lorine isn't asking
them. I am. God is.
</p>

<p>
Who are you?
</p>

<p>
Why are you here?
</p>

<p>
I believe I ask these questions about myself and God asks me these
questions about myself in prayer.
</p>

<p>
I am calling all these disparate pieces a spirituality of risk taking.
It's still quite rough. I hope to
</p>

<p>
risk more
</p>

<p>
reflect more
</p>

<p>
relate more
</p>

<p>
write more
</p>

<p>
And share more with you in the days ahead.
</p>
</div>
</div>
<div class="taglist"><a href="https://rillonline.github.io/tags.html">Tags</a>: <a href="https://rillonline.github.io/tag-page.html">Page</a> <a href="https://rillonline.github.io/tag-faith.html">Faith</a> </div><footer class="post-footer">
 <p>Thanks for reading.</p>
</footer></div>
<div id="postamble" class="status">
   <div class="post-meta">
   <div class="creator">
   <p>This blog post was created by Rill on a Raspberry Pi, with the help of <a href="https://www.gnu.org/software/emacs/">GNU Emacs</a>, <a href="https://orgmode.org/">Org mode</a>, and the <a href="https://github.com/bastibe/org-static-blog">org-static-blog</a> package.</p>
   </div>
   <div class="copyright-license">
   <p>© 2025 by Rill. Unless otherwise stated, all material is licensed under a <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License</a>.</p>
   </div>
  </div>
 </div>
</body>
</html>
